{
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            3,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "generatedBy": "keras v2.4.0",
  "format": "layers-model",
  "modelTopology": {
    "keras_version": "2.4.0",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "config": {
              "batch_input_shape": [
                null,
                3
              ],
              "dtype": "float32",
              "name": "dense_input",
              "ragged": false,
              "sparse": false
            },
            "class_name": "InputLayer"
          },
          {
            "config": {
              "bias_initializer": {
                "config": {},
                "class_name": "Zeros"
              },
              "batch_input_shape": [
                null,
                3
              ],
              "activity_regularizer": null,
              "kernel_regularizer": null,
              "kernel_initializer": {
                "config": {
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "units": 64,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "use_bias": true,
              "trainable": true,
              "activation": "relu",
              "name": "dense",
              "dtype": "float32"
            },
            "class_name": "Dense"
          },
          {
            "config": {
              "bias_initializer": {
                "config": {},
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "kernel_regularizer": null,
              "kernel_initializer": {
                "config": {
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "units": 64,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "use_bias": true,
              "trainable": true,
              "activation": "relu",
              "name": "dense_1",
              "dtype": "float32"
            },
            "class_name": "Dense"
          },
          {
            "config": {
              "bias_initializer": {
                "config": {},
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "kernel_regularizer": null,
              "kernel_initializer": {
                "config": {
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "units": 1,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "use_bias": true,
              "trainable": true,
              "activation": "linear",
              "name": "dense_2",
              "dtype": "float32"
            },
            "class_name": "Dense"
          }
        ]
      }
    },
    "backend": "tensorflow",
    "training_config": {
      "weighted_metrics": null,
      "loss": "mse",
      "loss_weights": null,
      "metrics": [
        "mae",
        "mse"
      ],
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "momentum": 0.0,
          "learning_rate": 0.0010000000474974513,
          "rho": 0.8999999761581421,
          "centered": false,
          "decay": 0.0,
          "name": "RMSprop",
          "epsilon": 1e-07
        }
      }
    }
  },
  "convertedBy": "TensorFlow.js Converter v2.7.0"
}